Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 130, 129)]   0                                            
__________________________________________________________________________________________________
conv_feature_extraction_model ( (None, 65, 512)      2630144     input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 65, 65)]     0                                            
__________________________________________________________________________________________________
transformer (Transformer)       ((None, 65, 512), (N 531150336   conv_feature_extraction_model[0][
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
conv_decoder_model (ConvDecoder (None, 130, 129)     3218049     transformer[0][0]                
__________________________________________________________________________________________________
wavs (Concatenate)              (None, 130, 129)     0           input_1[0][0]                    
                                                                 conv_decoder_model[0][0]         
__________________________________________________________________________________________________
linear_classifier (LinearClassi (None, 104)          86112       transformer[0][1]                
==================================================================================================
Total params: 537,084,641
Trainable params: 537,084,641
Non-trainable params: 0
__________________________________________________________________________________________________